# The Next iTunes: Optimizing Business Strategies for an Online Music Vendor

<img src="https://s3.amazonaws.com/dq-content/191/chinook-schema.svg" width="350" align="right">

A hypothetical client has asked us to analyze their business practices and make recommendations based on their available data. The database we're working with is provided by dataquest.io for educational purposes. The database has over 18,000 entries and we will be using SQLite to query the data for our analysis. The client has some specific questions regarding music acquistion and employee performance, but also asks us to make our own assessments based on our findings. Test.



## Opening, and Exploring the Data

Our client is Canadian online music vendor Chinook. They sell both new and classic music from a variety of genres. We're provided the database file and attached schema. Below we'll open the database in SQLite and check the master to verify that we have all of the data we expect. The data includes information on each customer, employee, track, and invoice from the last few years.

In [2]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

In [3]:
%%sql
SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ('table', 'view');

 * sqlite:///chinook.db
Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table')]

## Genre Recommendation

Chinook recently made a deal with a record label based in the US. The deal includes a choice of three new albums and a budget to advertise a single album in the States. Our client wants us to recommend which three of the four albums to acquire, and which to advertise. Because these albums are from new artists, we don't have data on how well their music sells. We'll instead base our analysis on the genre of each album. The four albums we have to choose from are Hip-Hop, Punk, Pop, and Blues. Below we query our database for music genres ranked by the percent of sales in the US.

In [4]:
%%sql
WITH genres_sold AS
    (SELECT g.name genre,
            SUM(il.quantity) tracks_sold
       FROM invoice i
       LEFT JOIN invoice_line il ON i.invoice_id = il.invoice_id
       LEFT JOIN track t ON t.track_id = il.track_id
       LEFT JOIN genre g ON t.genre_id = g.genre_id
      WHERE i.billing_country = 'USA'
      GROUP BY g.name)
SELECT genre,
       tracks_sold,
       ROUND(100 * CAST(tracks_sold AS Float)/
                   (SELECT SUM(tracks_sold)
                      FROM genres_sold)
                   , 1) AS percent_sold
FROM genres_sold
WHERE genre IN ('Pop', 'Alternative & Punk', 'Blues', 'Hip Hop/Rap');

 * sqlite:///chinook.db
Done.

[('Alternative & Punk', 130, 12.4),
 ('Blues', 36, 3.4),
 ('Hip Hop/Rap', 20, 1.9),
 ('Pop', 22, 2.1)]

The initial data seems to suggest that, of the four genres, `Hip Hop/Rap` has the lowest percent of sales. However, the diffence between `Hip Hop/Rap` and `Pop` amounts to just two sales, hardly a convincing difference. Additionally, this data only tells us the total number of sales in each genre. It's possible that the company only sells more `Alternative & Punk` music because they have more of it available. If the company doesn't have many `Hip Hop/Rap` or `Pop` offerings, that could explain the lower sales. We should analyze the total number of tracks in each genre, and compare that to their respective sales. Below, we query our data to find the number of US sales per track available in each genre.

In [5]:
%%sql
WITH genres_total AS
    (SELECT g.name name,
            COUNT(t.track_id) total_tracks
        FROM track t
        LEFT JOIN genre g ON t.genre_id = g.genre_id
        GROUP BY g.name),
genres_sold AS
    (SELECT g.name name,
            SUM(il.quantity) tracks_sold
            FROM invoice i
            LEFT JOIN invoice_line il ON i.invoice_id = il.invoice_id
            LEFT JOIN track t ON t.track_id = il.track_id
            LEFT JOIN genre g ON t.genre_id = g.genre_id
            WHERE i.billing_country = 'USA'
            GROUP BY g.name)

SELECT gt.name genre,
       gt.total_tracks total,
       gs.tracks_sold sold,
       ROUND(CAST(gs.tracks_sold AS Float)/
                   CAST(gt.total_tracks AS Float), 2) sales_per_track
FROM genres_total gt
LEFT JOIN genres_sold gs ON gt.name = gs.name
WHERE genre IN ('Pop', 'Alternative & Punk', 'Blues', 'Hip Hop/Rap')
ORDER BY sales_per_track DESC

 * sqlite:///chinook.db
Done.

[('Hip Hop/Rap', 35, 20, 0.57),
 ('Pop', 48, 22, 0.46),
 ('Blues', 81, 36, 0.44),
 ('Alternative & Punk', 332, 130, 0.39)]

Of our genres of interest, `Hip Hop/Rap` and `Pop` have the highest ratio of tracks sold to tracks offered. Increasing the company's offerings in these genre could genreate sales by targeting a part of our market with lower supply but higher demand.

It's worth noting two factors that may be skewing our results. The first is that `Punk` is not a genre on its own, but instead part of `Alternative & Punk`. There's even a different genre which is just `Alternative`. We could dig deeper into the categorization of these tracks, but the client tells us that this is beyond the scope and budget of the analysis. We'll take the data at face value, and assume all tracks in `Alternative & Punk` are 'Punk'.

The second issue is that the data set we have is quite small; we're looking at fewer than 50 sales for most of our genres. Let's repeat both our analyses, but now look global sales instead of just US sales. We'll do this by removing a single line from each of our queries.

In [6]:
%%sql
WITH genres_sold AS
    (SELECT g.name genre,
            SUM(il.quantity) tracks_sold
       FROM invoice i
       LEFT JOIN invoice_line il ON i.invoice_id = il.invoice_id
       LEFT JOIN track t ON t.track_id = il.track_id
       LEFT JOIN genre g ON t.genre_id = g.genre_id
      GROUP BY g.name)
    
SELECT genre,
       tracks_sold,
       ROUND(100 * CAST(tracks_sold AS Float)/
            (SELECT SUM(tracks_sold)
               FROM genres_sold)
             , 1) AS percent_sold
FROM genres_sold
WHERE genre IN ('Pop', 'Alternative & Punk', 'Blues', 'Hip Hop/Rap');

 * sqlite:///chinook.db
Done.

[('Alternative & Punk', 492, 10.3),
 ('Blues', 124, 2.6),
 ('Hip Hop/Rap', 33, 0.7),
 ('Pop', 63, 1.3)]

In [7]:
%%sql
WITH genres_total AS
    (SELECT g.name name,
            COUNT(t.track_id) total_tracks
       FROM track t
       LEFT JOIN genre g ON t.genre_id = g.genre_id
      GROUP BY g.name),

genres_sold AS
    (SELECT g.name name,
            SUM(il.quantity) tracks_sold
       FROM invoice i
       LEFT JOIN invoice_line il ON i.invoice_id = il.invoice_id
       LEFT JOIN track t ON t.track_id = il.track_id
       LEFT JOIN genre g ON t.genre_id = g.genre_id
      GROUP BY g.name)

SELECT gt.name genre,
       gt.total_tracks total,
       gs.tracks_sold sold,
       ROUND(CAST(gs.tracks_sold AS Float)/
             CAST(gt.total_tracks AS Float), 2) sales_per_track
  FROM genres_total gt
  LEFT JOIN genres_sold gs ON gt.name = gs.name
 WHERE genre IN ('Pop', 'Alternative & Punk', 'Blues', 'Hip Hop/Rap')
 ORDER BY sales_per_track DESC;

 * sqlite:///chinook.db
Done.

[('Blues', 81, 124, 1.53),
 ('Alternative & Punk', 332, 492, 1.48),
 ('Pop', 48, 63, 1.31),
 ('Hip Hop/Rap', 35, 33, 0.94)]

The results of all four analyses are compiled below.

| Genre | Percent US Sales | US Sales per Track | Percent Global Sales | Global Sales per Track |
| ----- | ----- | ----- | ----- | ----- |
| Blues | 3.4 | 0.44 | 2.6 | 1.53 |
| Hip Hop | 1.9 | 0.57 | 0.7 | 0.94 |
| Pop | 2.1 | 0.46 | 1.3 | 1.31 |
| Punk | 12.4 | 0.39 | 10.3 | 1.48 |

We would recommend two options for our client. In either scenario, the company should acquire the Blues, Pop, and Punk albums. These are the best performing options both in the US and globally. 

The first option is to maximize short-term revenue, by advertising the Punk album. This is the best performing genre, and could yeild the highest immeidate returns.

The second option is to advertise the Pop album. Of the three albums acquired, Pop has the highest US sales per track. This could indicate higher demand for this genre of music. The company doesn't offer many Pop tracks, so expanding their offerings can expand their customer base.

If the client wanted analysis of sales for all genres, we could run any of our queries above and simply remove the `WHERE` clause at the end to see the results for every genre.


## Employee Performance

When they first make a purchase, each customer is assigned to a sales support agent within the company. Our client is looking into professional development for one or all of its agents, and is also willing to replace an agent that is perfroming drastically lower than the others. The company would like us to analyze the sales performance of each agent. We also need to factor in how many customers each agent has assigned to them, and how long they've been at the company. Our metrics will be sales per customer and sales per month, as these will be more directly comparable numbers. Below, we join the employee, customer, and invoice tables to calculate the sales per customer and sales per month for each sales support agent.

In [8]:
%%sql
WITH employee_compare AS (
    SELECT e.first_name || ' ' || e.last_name employee_name, 
           ROUND(SUM(i.total), 2) sales_totals,
           DATE(e.hire_date) hire_date,
           ROUND(CAST(JULIANDAY(MAX(i.invoice_date))
                    - JULIANDAY(e.hire_date) AS Float)/30
                 , 0) months_with_company,
           COUNT(c.customer_id) customers
      FROM employee e
     INNER JOIN customer c ON e.employee_id = c.support_rep_id
     INNER JOIN invoice i on i.customer_id = c.customer_id
     GROUP BY employee_name)

SELECT employee_name,
       '$' || printf("%.2f", sales_totals) sales_totals,
       CAST(months_with_company AS Int) months_with_company,
       customers,
       '$' || printf("%.2f", ROUND(sales_totals/months_with_company, 2)) sales_per_month,
       '$' || printf("%.2f", ROUND(sales_totals/customers, 2)) sales_per_customer
  FROM employee_compare;

 * sqlite:///chinook.db
Done.

[('Jane Peacock', '$1731.51', 46, 212, '$37.64', '$8.17'),
 ('Margaret Park', '$1584.00', 45, 214, '$35.20', '$7.40'),
 ('Steve Johnson', '$1393.92', 39, 188, '$35.74', '$7.41')]

The difference between the best and worst performing agents amounts to less than $2.50/month. This does not indicate a wide gap in employee performance. If the client wanted to invest in professional development, they would be better off training the entire department together rather than just one agent. Replacing an agent would likely result in a net loss due to the cost of interviewing and training a new agent far outweighing the benefit.

## International Sales

Our client has customers in 24 countries around the world, and wants information on their international sales figures. They indicate that the `country` value is more accurate in the `customer` table than the `invoice` table, and that they'd like us to group countries with only one unique customer into an `Other` category. For each entry, the client wants the total number of customers, the total value of sales, the average value of sales per customer, and the average order value.

In [14]:
%%sql
WITH country_other AS (
    SELECT country,
           COUNT(customer_id) unique_customers,
           CASE
             WHEN country IN (SELECT country
                                FROM customer
                               GROUP BY country
                              HAVING COUNT(country) > 1)
             THEN 0
             ELSE 1
             END AS other
      FROM customer
     GROUP BY country),
    
customers_sorted AS (
    SELECT co.other,
           c.customer_id,
           CASE
             WHEN co.other = 0 THEN co.unique_customers
             ELSE (SELECT SUM(other) FROM country_other)
             END AS number_customers,
           CASE
             WHEN co.other = 0 THEN c.country
             ELSE 'Other'
             END AS countries
      FROM customer c
      LEFT JOIN country_other co ON c.country = co.country)
    
SELECT cs.countries countries,
       MAX(cs.number_customers) customers,
       '$' || printf("%.2f", ROUND(SUM(i.total),2)) total_sales,
       '$' || printf("%.2f", ROUND(SUM(i.total)/MAX(cs.number_customers),2)) sales_per_customer,
       '$' || printf("%.2f", ROUND(SUM(i.total)/COUNT(i.total),2)) average_order_value
  FROM invoice i
  LEFT JOIN customers_sorted cs ON cs.customer_id = i.customer_id
 GROUP BY countries
 ORDER BY other, customers DESC;

 * sqlite:///chinook.db
Done.

[('USA', 13, '$1040.49', '$80.04', '$7.94'),
 ('Canada', 8, '$535.59', '$66.95', '$7.05'),
 ('Brazil', 5, '$427.68', '$85.54', '$7.01'),
 ('France', 5, '$389.07', '$77.81', '$7.78'),
 ('Germany', 4, '$334.62', '$83.66', '$8.16'),
 ('United Kingdom', 3, '$245.52', '$81.84', '$8.77'),
 ('Czech Republic', 2, '$273.24', '$136.62', '$9.11'),
 ('India', 2, '$183.15', '$91.58', '$8.72'),
 ('Portugal', 2, '$185.13', '$92.57', '$6.38'),
 ('Other', 15, '$1094.94', '$73.00', '$7.45')]

The client has not requested any analysis; the data is for internal use.

## Albums vs Tracks

Chinook is considering a cost-saving measure regarding the way they acquire music. The company could save money by only acquiring the most popular tracks rather than the entire album. They'd like us to analyze how often customers purchase albums vs individual tracks. We need to sort each invoice into those that have every track from an album vs those that have only a few and those that have tracks from mulitple albums. The client indicated that their website does not allow customers to add tracks to purchases of whole albums, so we don't need to consider that scenario.

In [10]:
%%sql
WITH album_sizes AS (
    SELECT album_id album_id,
           COUNT(track_id) album_size
      FROM track
     GROUP BY album_id),

album_invoices AS (
    SELECT invoice_id,
           COUNT(il.track_id) tracks_sold,
           SUM(il.unit_price) sale_value,
           CASE
                WHEN COUNT(t.track_id) = a.album_size 
                     AND MAX(t.album_id) = MIN(t.album_id)
                THEN 'album'
                ELSE 'track'
                 END AS purchase_type
      FROM invoice_line il
      LEFT JOIN track t ON il.track_id = t.track_id
      LEFT JOIN album_sizes a ON a.album_id = t.album_id
     GROUP BY invoice_id)

SELECT purchase_type,
       COUNT(invoice_id) purchases,
       SUM(tracks_sold) tracks_sold,
       '$' || ROUND(SUM(sale_value), 2) sales
  FROM album_invoices
 GROUP BY purchase_type;

 * sqlite:///chinook.db
Done.

[('album', 114, 1476, '$1461.24'), ('track', 500, 3281, '$3248.19')]

Album sales account for just over 30% of sales revenue for the company. This isn't enough information to recommend purchasing tracks over albums. The specifics of the cost of tracks vs albums would need to be taken into account. That being said, tracks do generate more than twice as much revenue as sales. Further analysis could be done by only looking at albums with more than 5 tracks, as small albums and singles may be skewing the results.

## Future Analysis

With the data the client provided, we could offer a variety of additional analysis services. We could find tracks that have never sold, looking for patterns in genre, artist, and price. This would allow additional cost saving measures by no longer acquiring tracks in those categories. We could compare media types, and whether customers prefer protected file-types. If protected file types are important to consumers, that could be used in the advertising of the online store. We could observe invoice dates to determine times of year when customers shop most frequently, to be able to time deals and promotions accordingly.

In this project I've used SQL in the following ways:

1. Used the provided schema to join and filter tables to return specific data
2. Performed simple calculations on data including integers, dates, percents, and dollar values 
3. Used nested queries to answer more complex and conditional questions
4. Maintained readability of both results and code using standard formatting and organization

Jacob Simon, March 2022